app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC
SELECT 1 AS one FROM "recipes" LIMIT 1
---
  def index
    if user_signed_in? && params[:mine].present?
      @recipes = current_user.recipes.order(created_at: :desc)
      flash.now[:alert] = "You don't have recipes." if @recipes.empty?